In [1]:
import pymysql
from sqlalchemy import create_engine
import pandas as pd
import getpass  # To get the password without showing the input

In [2]:
password = getpass.getpass()
connection_string = 'mysql+pymysql://root:' + password + '@localhost/bank'
engine = create_engine(connection_string)
%load_ext sql
%sql {connection_string}

 ·········

'Connected: root@bank'

In [4]:
%%sql
select * from bank.account
limit 5;

 * mysql+pymysql://root:***@localhost/bank
5 rows affected.

[(1, 18, 'POPLATEK MESICNE', 950324),
 (2, 1, 'POPLATEK MESICNE', 930226),
 (3, 5, 'POPLATEK MESICNE', 970707),
 (4, 12, 'POPLATEK MESICNE', 960221),
 (5, 15, 'POPLATEK MESICNE', 970530)]

In [5]:
%%sql
select * from bank.loan
limit 5;

 * mysql+pymysql://root:***@localhost/bank
5 rows affected.

[(5314, 1787, 930705, 96396, 12, 8033.0, 'B'),
 (5316, 1801, 930711, 165960, 36, 4610.0, 'A'),
 (6863, 9188, 930728, 127080, 60, 2118.0, 'A'),
 (5325, 1843, 930803, 105804, 36, 2939.0, 'A'),
 (7240, 11013, 930906, 274740, 60, 4579.0, 'A')]

In SQL, the default is an INNER JOIN, so we can swap right and left tables without having any effect:

In [6]:
%%sql
select * from bank.loan l
join bank.account a
on l.account_id = a.account_id
limit 5;

 * mysql+pymysql://root:***@localhost/bank
5 rows affected.

[(5314, 1787, 930705, 96396, 12, 8033.0, 'B', 1787, 30, 'POPLATEK TYDNE', 930322),
 (5316, 1801, 930711, 165960, 36, 4610.0, 'A', 1801, 46, 'POPLATEK MESICNE', 930213),
 (6863, 9188, 930728, 127080, 60, 2118.0, 'A', 9188, 45, 'POPLATEK MESICNE', 930208),
 (5325, 1843, 930803, 105804, 36, 2939.0, 'A', 1843, 12, 'POPLATEK MESICNE', 930130),
 (7240, 11013, 930906, 274740, 60, 4579.0, 'A', 11013, 1, 'POPLATEK TYDNE', 930214)]

In [7]:
%%sql
select * from bank.account a
join bank.loan l
on a.account_id = l.account_id
limit 5;

 * mysql+pymysql://root:***@localhost/bank
5 rows affected.

[(1787, 30, 'POPLATEK TYDNE', 930322, 5314, 1787, 930705, 96396, 12, 8033.0, 'B'),
 (1801, 46, 'POPLATEK MESICNE', 930213, 5316, 1801, 930711, 165960, 36, 4610.0, 'A'),
 (9188, 45, 'POPLATEK MESICNE', 930208, 6863, 9188, 930728, 127080, 60, 2118.0, 'A'),
 (1843, 12, 'POPLATEK MESICNE', 930130, 5325, 1843, 930803, 105804, 36, 2939.0, 'A'),
 (11013, 1, 'POPLATEK TYDNE', 930214, 7240, 11013, 930906, 274740, 60, 4579.0, 'A')]

But if we perform a LEFT JOIN the difference is huge:

In [8]:
%%sql
select * from bank.loan l
left join bank.account a
on l.account_id = a.account_id
limit 5;

 * mysql+pymysql://root:***@localhost/bank
5 rows affected.

[(5314, 1787, 930705, 96396, 12, 8033.0, 'B', 1787, 30, 'POPLATEK TYDNE', 930322),
 (5316, 1801, 930711, 165960, 36, 4610.0, 'A', 1801, 46, 'POPLATEK MESICNE', 930213),
 (6863, 9188, 930728, 127080, 60, 2118.0, 'A', 9188, 45, 'POPLATEK MESICNE', 930208),
 (5325, 1843, 930803, 105804, 36, 2939.0, 'A', 1843, 12, 'POPLATEK MESICNE', 930130),
 (7240, 11013, 930906, 274740, 60, 4579.0, 'A', 11013, 1, 'POPLATEK TYDNE', 930214)]

In [9]:
%%sql
select * from bank.account a
left join bank.loan l
on a.account_id = l.account_id
limit 5;

 * mysql+pymysql://root:***@localhost/bank
5 rows affected.

[(1, 18, 'POPLATEK MESICNE', 950324, None, None, None, None, None, None, None),
 (2, 1, 'POPLATEK MESICNE', 930226, 4959, 2, 940105, 80952, 24, 3373.0, 'A'),
 (3, 5, 'POPLATEK MESICNE', 970707, None, None, None, None, None, None, None),
 (4, 12, 'POPLATEK MESICNE', 960221, None, None, None, None, None, None, None),
 (5, 15, 'POPLATEK MESICNE', 970530, None, None, None, None, None, None, None)]

And the same is true for a RIGHT JOIN:

In [10]:
%%sql
select * from bank.loan l
right join bank.account a
on l.account_id = a.account_id
limit 5;

 * mysql+pymysql://root:***@localhost/bank
5 rows affected.

[(None, None, None, None, None, None, None, 1, 18, 'POPLATEK MESICNE', 950324),
 (4959, 2, 940105, 80952, 24, 3373.0, 'A', 2, 1, 'POPLATEK MESICNE', 930226),
 (None, None, None, None, None, None, None, 3, 5, 'POPLATEK MESICNE', 970707),
 (None, None, None, None, None, None, None, 4, 12, 'POPLATEK MESICNE', 960221),
 (None, None, None, None, None, None, None, 5, 15, 'POPLATEK MESICNE', 970530)]

In [11]:
%%sql
select * from bank.account a
right join bank.loan l
on a.account_id = l.account_id
limit 5;

 * mysql+pymysql://root:***@localhost/bank
5 rows affected.

[(1787, 30, 'POPLATEK TYDNE', 930322, 5314, 1787, 930705, 96396, 12, 8033.0, 'B'),
 (1801, 46, 'POPLATEK MESICNE', 930213, 5316, 1801, 930711, 165960, 36, 4610.0, 'A'),
 (9188, 45, 'POPLATEK MESICNE', 930208, 6863, 9188, 930728, 127080, 60, 2118.0, 'A'),
 (1843, 12, 'POPLATEK MESICNE', 930130, 5325, 1843, 930803, 105804, 36, 2939.0, 'A'),
 (11013, 1, 'POPLATEK TYDNE', 930214, 7240, 11013, 930906, 274740, 60, 4579.0, 'A')]

**Example 1: Write a query to extract information from the `client` and the `district` tables to get information for all the clients of the city and region they are from.**

Step 1

In [12]:
%%sql
select * from bank.client c 
join district d
on c.district_id = d.A1
limit 5;

 * mysql+pymysql://root:***@localhost/bank
5 rows affected.

[(1, 706213, 18, 18, 'Pisek', 'south Bohemia', 70699, 60, 13, 2, 1, 4, 65.3, 8968, 2.83, 3.35, 131, 1740, 1910),
 (2, 450204, 1, 1, 'Hl.m. Praha', 'Prague', 1204953, 0, 0, 0, 1, 1, 100.0, 12541, 0.29, 0.43, 167, 85677, 99107),
 (3, 406009, 1, 1, 'Hl.m. Praha', 'Prague', 1204953, 0, 0, 0, 1, 1, 100.0, 12541, 0.29, 0.43, 167, 85677, 99107),
 (4, 561201, 5, 5, 'Kolin', 'central Bohemia', 95616, 65, 30, 4, 1, 6, 51.4, 9307, 3.85, 4.43, 118, 2616, 3040),
 (5, 605703, 5, 5, 'Kolin', 'central Bohemia', 95616, 65, 30, 4, 1, 6, 51.4, 9307, 3.85, 4.43, 118, 2616, 3040)]

Step 2

In [13]:
%%sql
select c.client_id, c.birth_number, c.district_id, d.A2, d.A3
from bank.client c 
join bank.district d
on c.district_id = d.A1
limit 5;

 * mysql+pymysql://root:***@localhost/bank
5 rows affected.

[(1, 706213, 18, 'Pisek', 'south Bohemia'),
 (2, 450204, 1, 'Hl.m. Praha', 'Prague'),
 (3, 406009, 1, 'Hl.m. Praha', 'Prague'),
 (4, 561201, 5, 'Kolin', 'central Bohemia'),
 (5, 605703, 5, 'Kolin', 'central Bohemia')]

**Example 2: Write queries to extract information about the accounts:**

a) returning `account_id`, `operation`, `frequency`, sum of amount, sum of balance,

b) where the balance is over 1000,

c) `operation` type is `VKLAD` and

d) that have an aggregated amount of over 500,000.

Step 1

In [14]:
%%sql
select * from bank.trans t
left join bank.account a
on t.account_id = a.account_id
limit 2;

 * mysql+pymysql://root:***@localhost/bank
2 rows affected.

[(695247, 2378, 930101, 'PRIJEM', 'VKLAD', 700.0, 700.0, '', '', 0, 2378, 16, 'POPLATEK MESICNE', 930101),
 (171812, 576, 930101, 'PRIJEM', 'VKLAD', 900.0, 900.0, '', '', 0, 576, 55, 'POPLATEK MESICNE', 930101)]

Step 2

In [15]:
%%sql
select * from bank.trans t left join bank.account a on t.account_id = a.account_id
where t.operation = 'VKLAD' and t.balance > 1000
limit 2;

 * mysql+pymysql://root:***@localhost/bank
2 rows affected.

[(771035, 2632, 930102, 'PRIJEM', 'VKLAD', 1100.0, 1100.0, '', '', 0, 2632, 24, 'POPLATEK MESICNE', 930102),
 (725751, 2484, 930103, 'PRIJEM', 'VKLAD', 1100.0, 1100.0, '', '', 0, 2484, 74, 'POPLATEK MESICNE', 930103)]

Step 3

In [16]:
%%sql
select t.account_id, t.operation, a.frequency, sum(t.amount) as TotalAmount, sum(t.balance) as TotalBalance
from bank.trans as t 
left join bank.account as a on t.account_id = a.account_id
where t.operation = 'VKLAD' and balance > 1000
group by t.account_id, t.operation, a.frequency
limit 2;

 * mysql+pymysql://root:***@localhost/bank
2 rows affected.

[(2632, 'VKLAD', 'POPLATEK MESICNE', 526836.0, 1486478.701171875),
 (2484, 'VKLAD', 'POPLATEK MESICNE', 764226.0, 1860738.90625)]

Step 4

In [17]:
%%sql
select t.account_id, t.operation, a.frequency, sum(amount) as TotalAmount, sum(balance) as TotalBalance
from bank.trans t 
left join bank.account a on t.account_id = a.account_id
where t.operation = 'VKLAD' and balance > 1000
group by t.account_id, t.operation, a.frequency
having TotalAmount > 500000
order by TotalAmount desc
limit 10;

 * mysql+pymysql://root:***@localhost/bank
10 rows affected.

[(2838, 'VKLAD', 'POPLATEK TYDNE', 3303399.0, 11616522.32421875),
 (2219, 'VKLAD', 'POPLATEK MESICNE', 3148443.0, 11380770.38671875),
 (3521, 'VKLAD', 'POPLATEK MESICNE', 3132627.0, 9598544.96875),
 (2762, 'VKLAD', 'POPLATEK MESICNE', 3077049.0, 9669863.0),
 (2486, 'VKLAD', 'POPLATEK MESICNE', 3026314.0, 8192549.109375),
 (3674, 'VKLAD', 'POPLATEK MESICNE', 2972249.0, 10109657.125),
 (8625, 'VKLAD', 'POPLATEK MESICNE', 2953583.0, 9523305.298828125),
 (4321, 'VKLAD', 'POPLATEK MESICNE', 2952028.0, 12127616.8515625),
 (1286, 'VKLAD', 'POPLATEK PO OBRATU', 2945086.0, 9552576.630859375),
 (5129, 'VKLAD', 'POPLATEK MESICNE', 2922412.0, 7718455.521240234)]

# 3.01 Activity 4

1. Create a list of all the clients together with region and district, ordered by region and district.
2. Count how many clients do we have per region and district.
3. Add to the previous query the number of clients per 10.000 inhabitants.

**1)**

In [18]:
%%sql
select c.client_id, d.A3, d.A2 
from bank.district as d
inner join bank.client as c
on c.district_id = d.A1
order by d.A3, d.A2
limit 3;

 * mysql+pymysql://root:***@localhost/bank
3 rows affected.

[(13090, 'central Bohemia', 'Benesov'),
 (12145, 'central Bohemia', 'Benesov'),
 (12144, 'central Bohemia', 'Benesov')]

**2)**

In [19]:
%%sql
select d.A3 as Region, d.A2 as District, count(c.client_id) as num_clients 
from bank.district as d
inner join bank.client as c
on c.district_id = d.A1
group by d.A3, d.A2
order by d.A3, d.A2
limit 3;

 * mysql+pymysql://root:***@localhost/bank
3 rows affected.

[('central Bohemia', 'Benesov', 46),
 ('central Bohemia', 'Beroun', 63),
 ('central Bohemia', 'Kladno', 50)]

**3)**

In [20]:
%%sql
select d.A3, d.A2, count(c.client_id) as client_number, round(10000*count(c.client_id)/d.A4) as clients_per_10000  
from bank.district as d
inner join bank.client as c
on c.district_id = d.A1
group by d.A3, d.A2
order by d.A3, d.A2
limit 3;

 * mysql+pymysql://root:***@localhost/bank
3 rows affected.

[('central Bohemia', 'Benesov', 46, Decimal('5')),
 ('central Bohemia', 'Beroun', 63, Decimal('8')),
 ('central Bohemia', 'Kladno', 50, Decimal('3'))]